{"basics":{"name":"Valerio Spadaro","label":"Senior DevOps Engineer","image":"","email":"spadaro.valerio@gmail.com","url":"https://snakebyte85.github.io/resume/","summary":"Il mio obiettivo principale consiste nel coltivare la mia grande passione per la programmazione, manutenzione e rilascio sofware, imparando nuove tecnologie e maturando l’esperienza necessaria per diventare un tecnico qualificato in ambito DevOps e CICD.\n\nPosseggo delle ottime capacità di analisi e implementazione di soluzioni informatiche, con grande motivazione e tendenza all’apprendimento rapido di nuove tecnologie (linguaggi, librerie, framework, ambienti di sviluppo, strumenti di CICD).\n\nNel lavoro tendo a seguire nei limiti del possibile le best practices del momento, in quanto convinto sostenitore della qualità del software, opponendomi alla filosofia del \"basta che funzioni\".\n\nHo recentemente acquisito esperienze e competenze riguardo tutto ciò che ruota intorno alla cultura DevOps, imparando l'utilizzo dei tool e tecnologie più importanti quali Jenkins, Git, Docker, Kubernetes, Helm, Vagrant, Ansible, Tekton e ArgoCD.\n\nIn passato maggiormente competente nella conoscenza del linguaggio Java standard e nello sviluppo di applicazioni web su piattaforma JEE/Spring con esperienza nella maggior parte dei settori più critici in ambito di sviluppo e mantenimento del software: bugfix, sviluppo, test, build, deploy, reverse engineering, code review e documentazione tecnica.\n\nRecentemente per esigenze DevOps e non, sono diventato competente in linguaggi più evoluti come Golang e Kotlin.\n\nSono iscritto alle categorie protette con percentuale riconosciuta di invalidità civile del 60%. E’ garantita la completa mobilità.\n\nLavoro attualmente in full remote working e attualmente non sono interessato a lavori che non obbligano la mia presenza fisica a più di una volta al mese\n","location":{"city":"Bologna","countryCode":"IT","region":"Emilia Romagna"},"profiles":[{"network":"Github","username":"snakebyte85","url":"https://github.com/snakebyte85/"},{"network":"Linkedin","url":"https://www.linkedin.com/in/valeriospadaro/"}]},"work":[{"name":"Cuebiq","position":"Senior DevOps Engineer","url":"https://cuebiq.com/","startDate":"2021-06-01T00:00:00.000Z","summary":"Sviluppo, gestione e manutenzione del ciclo Devops in azienda.\nIntroduzione e mantenimento del software ArgoCD per la parte di delivery e deploy del software in azienda, con migrazione da vecchio metodo tramite helmfile.\nSviluppo e mantenimento di alcuni microservizi (Kotlin/Golang) della piattaforma\nSupporto ai colleghi sviluppatori per i tool interni.\n\nTecnologie usate: Kubernetes, Docker, Helm, Skaffold, Travis, Golang, Kotlin, Tekton, ArgoCD\n"}],"education":[{"institution":"Università degli Studi di Messina","area":"Scienze Informatiche","studyType":"Diploma di laurea triennale","startDate":"2004-09-01T00:00:00.000Z","endDate":"2010-03-31T00:00:00.000Z","score":"110 e lode"},{"institution":"Istituto Tecnico Industriale Statale Verona Trento di Messina","studyType":"Scuola superiore","startDate":"1999-09-01T00:00:00.000Z","endDate":"2004-06-30T00:00:00.000Z","score":"94/100"}],"certificates":[{"name":"Java SE 7 Programmer 1","date":"2015-03-13T00:00:00.000Z","issuer":"Oracle"},{"name":"First Certificate in English (B2)","date":"2020-06-28T00:00:00.000Z","issuer":"Cambridge University Press & Assessment English"}],"skills":[{"name":"DevOps"},{"name":"Helm"},{"name":"Kubernetes"},{"name":"Skaffold"},{"name":"ArgoCD"},{"name":"Tekton"},{"name":"Maven"},{"name":"Ant"},{"name":"Git"},{"name":"Github"},{"name":"Jenkins"},{"name":"Vagrant"},{"name":"Ansible"},{"name":"Travis"},{"name":"Golang"},{"name":"Sviluppo software"},{"name":"Java"},{"name":"Spring"},{"name":"Spring Boot"},{"name":"Hibernate"},{"name":"JPA"},{"name":"Rest"},{"name":"JAX-WS"},{"name":"JAX-RS"},{"name":"Camunda"},{"name":"Activiti"},{"name":"Linux"},{"name":"SQL"},{"name":"Oracle"},{"name":"MySQL/Mariadb"},{"name":"Postgres"}],"languages":[{"language":"Italiano","fluency":"Nativo"},{"language":"Inglese","fluency":"Conoscenza lavorativa"}]}
